from string import Template

### rag prompts ###

system_prompt = Template(
    "\n".join(
        [
            "أنت مساعد لتوليد استجابة للمستخدم",
            "سيتم تزويدك باستعلام المستخدم وقائمة من المستندات المتعلقة بالاستعلام",
            "يجب عليك توليد استجابة بناءً فقط على المستندات المقدمة",
            "تجاهل المستندات غير ذات الصلة بالاستعلام",
            "يمكنك الاعتذار إذا لم تعرف الإجابة من المستندات",
            "يجب أن تولد الاستجابة بنفس لغة الاستعلام",
            "كن مهذبًا واحترافيًا في استجابتك",
            "كن دقيقًا ومختصرًا في استجابتك، وتجنب المعلومات غير الضرورية",
        ]
    )
)

### document prompts ###

document_prompt = Template(
    "\n".join(
        [
            "##المستند رقم:$doc_num",
            "### المحتوى:$content",
        ]
    )
)

footer_prompt = Template(
    "\n".join(
        [
            "بناءً فقط على المستندات أعلاه، قم بتوليد استجابة للمستخدم",
            "##السؤال:$query",
            "",
            "##الإجابة:",
        ]
    )
)
